arr = [[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0]]

print(f"세로(행의 갯수): {len(arr)}")
print(f"가로(열의 갯수): {len(arr[0])}")


# for r in range(2, 5):
#     for c in range(2, 5):
#         arr[r][c] += 1

# for r in range(3, 7):
#     for c in range(3, 7):
#         arr[r][c] += 2



# for r in range(10):
#     for c in range(10):
#         print(f"{arr[r][c]}  ", end='')

for r in range(5):
    for c in range(5):





        

        


